Revit 2027 API
RibbonPanel.Enabled Property
Gets or sets a value indicating whether the RibbonPanel can respond to user interaction.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
public:
property bool Enabled {
	bool get ();
	void set (bool value);
}
member Enabled : bool with get, set
Property Value
Boolean
True if the panel allows interaction, false if the panel disallows interaction with all the controls it contains.
See Also
Reference
RibbonPanel Class
Autodesk.Revit.UI Namespace